# Задание 1.1
print("Введите три числа:")
x = int(input())
y = int(input())
z = int(input())

a = [x, y, z]
b = min(a)
print("Минимальное число:")
print(b)